todo_mvc_v2/app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos"
SELECT COUNT(*) FROM "todos"
---
  def index
    @todos = Todo.all
    @all_todos_count = Todo.count

SELECT "todos".* FROM "todos" WHERE "todos"."complete" = 'f'
SELECT COUNT(*) FROM "todos"
---
  def active
    @todos = Todo.where(complete: false)
    @all_todos_count = Todo.count

SELECT "todos".* FROM "todos" WHERE "todos"."complete" = 't'
SELECT COUNT(*) FROM "todos"
---
  def completed
    @todos = Todo.where(complete: true)
    @all_todos_count = Todo.count

INSERT INTO "todos" ("todo_item", "created_at", "updated_at") VALUES (?, ?, ?)  [["todo_item", "Check"], ["created_at", "2015-06-03 18:22:03.435654"], ["updated_at", "2015-06-03 18:22:03.435654"]]
---
  def create
    params[:todo][:todo_item].strip!
    if params[:todo][:todo_item].length > 0
      Todo.create(params.require(:todo).permit(:todo_item))

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "todos" SET "complete" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["complete", "t"], ["updated_at", "2015-06-03 18:32:27.419658"], ["id", 1]]
---
  def toggle
    todo = Todo.find(params[:id])
    todo.toggle!(:complete)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
---
  def destroy
    todo = Todo.find(params[:id])
    todo.destroy