todo_mvc_v2/app/controllers/todo_controller.rb

  def index
  	@todos = Todo.all ### we use the @symbol to render in the template and then instance when we just need them for a second
  	@all_todos_count = Todo.count
---
SELECT "todos".* FROM "todos"
SELECT COUNT(*) FROM "todos"